GopalSaraf/Practicals/PSDL/include/proc/pic16lf1784.inc
// Register: FVRCON
#define FVRCON FVRCON
FVRCON                                   equ 0117h
// bitfield definitions
FVRCON_ADFVR0_POSN                       equ 0000h
FVRCON_ADFVR0_POSITION                   equ 0000h
FVRCON_ADFVR0_SIZE                       equ 0001h
FVRCON_ADFVR0_LENGTH                     equ 0001h
FVRCON_ADFVR0_MASK                       equ 0001h
FVRCON_ADFVR1_POSN                       equ 0001h
FVRCON_ADFVR1_POSITION                   equ 0001h
FVRCON_ADFVR1_SIZE                       equ 0001h
FVRCON_ADFVR1_LENGTH                     equ 0001h
FVRCON_ADFVR1_MASK                       equ 0002h
FVRCON_CDAFVR0_POSN                      equ 0002h
FVRCON_CDAFVR0_POSITION                  equ 0002h
FVRCON_CDAFVR0_SIZE                      equ 0001h
FVRCON_CDAFVR0_LENGTH                    equ 0001h
FVRCON_CDAFVR0_MASK                      equ 0004h
FVRCON_CDAFVR1_POSN                      equ 0003h
FVRCON_CDAFVR1_POSITION                  equ 0003h
FVRCON_CDAFVR1_SIZE                      equ 0001h
FVRCON_CDAFVR1_LENGTH                    equ 0001h
FVRCON_CDAFVR1_MASK                      equ 0008h
FVRCON_TSRNG_POSN                        equ 0004h
FVRCON_TSRNG_POSITION                    equ 0004h
FVRCON_TSRNG_SIZE                        equ 0001h
FVRCON_TSRNG_LENGTH                      equ 0001h
FVRCON_TSRNG_MASK                        equ 0010h
FVRCON_TSEN_POSN                         equ 0005h
FVRCON_TSEN_POSITION                     equ 0005h
FVRCON_TSEN_SIZE                         equ 0001h
FVRCON_TSEN_LENGTH                       equ 0001h
FVRCON_TSEN_MASK                         equ 0020h
FVRCON_FVRRDY_POSN                       equ 0006h
FVRCON_FVRRDY_POSITION                   equ 0006h
FVRCON_FVRRDY_SIZE                       equ 0001h
FVRCON_FVRRDY_LENGTH                     equ 0001h
FVRCON_FVRRDY_MASK                       equ 0040h
FVRCON_FVREN_POSN                        equ 0007h
FVRCON_FVREN_POSITION                    equ 0007h
FVRCON_FVREN_SIZE                        equ 0001h
FVRCON_FVREN_LENGTH                      equ 0001h
FVRCON_FVREN_MASK                        equ 0080h
FVRCON_ADFVR_POSN                        equ 0000h
FVRCON_ADFVR_POSITION                    equ 0000h
FVRCON_ADFVR_SIZE                        equ 0002h
FVRCON_ADFVR_LENGTH                      equ 0002h
FVRCON_ADFVR_MASK                        equ 0003h
FVRCON_CDAFVR_POSN                       equ 0002h
FVRCON_CDAFVR_POSITION                   equ 0002h
FVRCON_CDAFVR_SIZE                       equ 0002h
FVRCON_CDAFVR_LENGTH                     equ 0002h
FVRCON_CDAFVR_MASK                       equ 000Ch

// Register: DACCON0
#define DACCON0 DACCON0
DACCON0                                  equ 0118h
// bitfield definitions
DACCON0_DACNSS_POSN                      equ 0000h
DACCON0_DACNSS_POSITION                  equ 0000h
DACCON0_DACNSS_SIZE                      equ 0001h
DACCON0_DACNSS_LENGTH                    equ 0001h
DACCON0_DACNSS_MASK                      equ 0001h
DACCON0_DACPSS0_POSN                     equ 0002h
DACCON0_DACPSS0_POSITION                 equ 0002h
DACCON0_DACPSS0_SIZE                     equ 0001h
DACCON0_DACPSS0_LENGTH                   equ 0001h
DACCON0_DACPSS0_MASK                     equ 0004h
DACCON0_DACPSS1_POSN                     equ 0003h
DACCON0_DACPSS1_POSITION                 equ 0003h
DACCON0_DACPSS1_SIZE                     equ 0001h
DACCON0_DACPSS1_LENGTH                   equ 0001h
DACCON0_DACPSS1_MASK                     equ 0008h
DACCON0_DACOE2_POSN                      equ 0004h
DACCON0_DACOE2_POSITION                  equ 0004h
DACCON0_DACOE2_SIZE                      equ 0001h
DACCON0_DACOE2_LENGTH                    equ 0001h
DACCON0_DACOE2_MASK                      equ 0010h
DACCON0_DACOE1_POSN                      equ 0005h
DACCON0_DACOE1_POSITION                  equ 0005h
DACCON0_DACOE1_SIZE                      equ 0001h
DACCON0_DACOE1_LENGTH                    equ 0001h
DACCON0_DACOE1_MASK                      equ 0020h
DACCON0_DACEN_POSN                       equ 0007h
DACCON0_DACEN_POSITION                   equ 0007h
DACCON0_DACEN_SIZE                       equ 0001h
DACCON0_DACEN_LENGTH                     equ 0001h
DACCON0_DACEN_MASK                       equ 0080h
DACCON0_DACPSS_POSN                      equ 0002h
DACCON0_DACPSS_POSITION                  equ 0002h
DACCON0_DACPSS_SIZE                      equ 0002h
DACCON0_DACPSS_LENGTH                    equ 0002h
DACCON0_DACPSS_MASK                      equ 000Ch

// Register: DACCON1
#define DACCON1 DACCON1
DACCON1                                  equ 0119h
// bitfield definitions
DACCON1_DACR0_POSN                       equ 0000h
DACCON1_DACR0_POSITION                   equ 0000h
DACCON1_DACR0_SIZE                       equ 0001h
DACCON1_DACR0_LENGTH                     equ 0001h
DACCON1_DACR0_MASK                       equ 0001h
DACCON1_DACR1_POSN                       equ 0001h
DACCON1_DACR1_POSITION                   equ 0001h
DACCON1_DACR1_SIZE                       equ 0001h
DACCON1_DACR1_LENGTH                     equ 0001h
DACCON1_DACR1_MASK                       equ 0002h
DACCON1_DACR2_POSN                       equ 0002h
DACCON1_DACR2_POSITION                   equ 0002h
DACCON1_DACR2_SIZE                       equ 0001h
DACCON1_DACR2_LENGTH                     equ 0001h
DACCON1_DACR2_MASK                       equ 0004h
DACCON1_DACR3_POSN                       equ 0003h
DACCON1_DACR3_POSITION                   equ 0003h
DACCON1_DACR3_SIZE                       equ 0001h
DACCON1_DACR3_LENGTH                     equ 0001h
DACCON1_DACR3_MASK                       equ 0008h
DACCON1_DACR4_POSN                       equ 0004h
DACCON1_DACR4_POSITION                   equ 0004h
DACCON1_DACR4_SIZE                       equ 0001h
DACCON1_DACR4_LENGTH                     equ 0001h
DACCON1_DACR4_MASK                       equ 0010h
DACCON1_DACR5_POSN                       equ 0005h
DACCON1_DACR5_POSITION                   equ 0005h
DACCON1_DACR5_SIZE                       equ 0001h
DACCON1_DACR5_LENGTH                     equ 0001h
DACCON1_DACR5_MASK                       equ 0020h
DACCON1_DACR6_POSN                       equ 0006h
DACCON1_DACR6_POSITION                   equ 0006h
DACCON1_DACR6_SIZE                       equ 0001h
DACCON1_DACR6_LENGTH                     equ 0001h
DACCON1_DACR6_MASK                       equ 0040h
DACCON1_DACR7_POSN                       equ 0007h
DACCON1_DACR7_POSITION                   equ 0007h
DACCON1_DACR7_SIZE                       equ 0001h
DACCON1_DACR7_LENGTH                     equ 0001h
DACCON1_DACR7_MASK                       equ 0080h
DACCON1_DACR_POSN                        equ 0000h
DACCON1_DACR_POSITION                    equ 0000h
DACCON1_DACR_SIZE                        equ 0008h
DACCON1_DACR_LENGTH                      equ 0008h
DACCON1_DACR_MASK                        equ 00FFh

// Register: CM4CON0
#define CM4CON0 CM4CON0
CM4CON0                                  equ 011Ah
// bitfield definitions
CM4CON0_C4SYNC_POSN                      equ 0000h
CM4CON0_C4SYNC_POSITION                  equ 0000h
CM4CON0_C4SYNC_SIZE                      equ 0001h
CM4CON0_C4SYNC_LENGTH                    equ 0001h
CM4CON0_C4SYNC_MASK                      equ 0001h
CM4CON0_C4HYS_POSN                       equ 0001h
CM4CON0_C4HYS_POSITION                   equ 0001h
CM4CON0_C4HYS_SIZE                       equ 0001h
CM4CON0_C4HYS_LENGTH                     equ 0001h
CM4CON0_C4HYS_MASK                       equ 0002h
CM4CON0_C4SP_POSN                        equ 0002h
CM4CON0_C4SP_POSITION                    equ 0002h
CM4CON0_C4SP_SIZE                        equ 0001h
CM4CON0_C4SP_LENGTH                      equ 0001h
CM4CON0_C4SP_MASK                        equ 0004h
CM4CON0_C4ZLF_POSN                       equ 0003h
CM4CON0_C4ZLF_POSITION                   equ 0003h
CM4CON0_C4ZLF_SIZE                       equ 0001h
CM4CON0_C4ZLF_LENGTH                     equ 0001h
CM4CON0_C4ZLF_MASK                       equ 0008h
CM4CON0_C4POL_POSN                       equ 0004h
CM4CON0_C4POL_POSITION                   equ 0004h
CM4CON0_C4POL_SIZE                       equ 0001h
CM4CON0_C4POL_LENGTH                     equ 0001h
CM4CON0_C4POL_MASK                       equ 0010h
CM4CON0_C4OE_POSN                        equ 0005h
CM4CON0_C4OE_POSITION                    equ 0005h
CM4CON0_C4OE_SIZE                        equ 0001h
CM4CON0_C4OE_LENGTH                      equ 0001h
CM4CON0_C4OE_MASK                        equ 0020h
CM4CON0_C4OUT_POSN                       equ 0006h
CM4CON0_C4OUT_POSITION                   equ 0006h
CM4CON0_C4OUT_SIZE                       equ 0001h
CM4CON0_C4OUT_LENGTH                     equ 0001h
CM4CON0_C4OUT_MASK                       equ 0040h
CM4CON0_C4ON_POSN                        equ 0007h
CM4CON0_C4ON_POSITION                    equ 0007h
CM4CON0_C4ON_SIZE                        equ 0001h
CM4CON0_C4ON_LENGTH                      equ 0001h
CM4CON0_C4ON_MASK                        equ 0080h

// Register: CM4CON1
#define CM4CON1 CM4CON1
CM4CON1                                  equ 011Bh
// bitfield definitions
CM4CON1_C4NCH_POSN                       equ 0000h
CM4CON1_C4NCH_POSITION                   equ 0000h
CM4CON1_C4NCH_SIZE                       equ 0003h
CM4CON1_C4NCH_LENGTH                     equ 0003h
CM4CON1_C4NCH_MASK                       equ 0007h
CM4CON1_C4PCH_POSN                       equ 0003h
CM4CON1_C4PCH_POSITION                   equ 0003h
CM4CON1_C4PCH_SIZE                       equ 0003h
CM4CON1_C4PCH_LENGTH                     equ 0003h
CM4CON1_C4PCH_MASK                       equ 0038h
CM4CON1_C4INTN_POSN                      equ 0006h
CM4CON1_C4INTN_POSITION                  equ 0006h
CM4CON1_C4INTN_SIZE                      equ 0001h
CM4CON1_C4INTN_LENGTH                    equ 0001h
CM4CON1_C4INTN_MASK                      equ 0040h
CM4CON1_C4INTP_POSN                      equ 0007h
CM4CON1_C4INTP_POSITION                  equ 0007h
CM4CON1_C4INTP_SIZE                      equ 0001h
CM4CON1_C4INTP_LENGTH                    equ 0001h
CM4CON1_C4INTP_MASK                      equ 0080h
CM4CON1_C4NCH0_POSN                      equ 0000h
CM4CON1_C4NCH0_POSITION                  equ 0000h
CM4CON1_C4NCH0_SIZE                      equ 0001h
CM4CON1_C4NCH0_LENGTH                    equ 0001h
CM4CON1_C4NCH0_MASK                      equ 0001h
CM4CON1_C4NCH1_POSN                      equ 0001h
CM4CON1_C4NCH1_POSITION                  equ 0001h
CM4CON1_C4NCH1_SIZE                      equ 0001h
CM4CON1_C4NCH1_LENGTH                    equ 0001h
CM4CON1_C4NCH1_MASK                      equ 0002h
CM4CON1_C4NCH2_POSN                      equ 0002h
CM4CON1_C4NCH2_POSITION                  equ 0002h
CM4CON1_C4NCH2_SIZE                      equ 0001h
CM4CON1_C4NCH2_LENGTH                    equ 0001h
CM4CON1_C4NCH2_MASK                      equ 0004h
CM4CON1_C4PCH0_POSN                      equ 0003h
CM4CON1_C4PCH0_POSITION                  equ 0003h
CM4CON1_C4PCH0_SIZE                      equ 0001h
CM4CON1_C4PCH0_LENGTH                    equ 0001h
CM4CON1_C4PCH0_MASK                      equ 0008h
CM4CON1_C4PCH1_POSN                      equ 0004h
CM4CON1_C4PCH1_POSITION                  equ 0004h
CM4CON1_C4PCH1_SIZE                      equ 0001h
CM4CON1_C4PCH1_LENGTH                    equ 0001h
CM4CON1_C4PCH1_MASK                      equ 0010h
CM4CON1_C4PCH2_POSN                      equ 0005h
CM4CON1_C4PCH2_POSITION                  equ 0005h
CM4CON1_C4PCH2_SIZE                      equ 0001h
CM4CON1_C4PCH2_LENGTH                    equ 0001h
CM4CON1_C4PCH2_MASK                      equ 0020h

