GopalSaraf/Practicals/PSDL/include/proc/pic16lf1784.inc
// Register: APFCON2
#define APFCON2 APFCON2
APFCON2                                  equ 011Ch
// bitfield definitions
APFCON2_CCP3SEL_POSN                     equ 0000h
APFCON2_CCP3SEL_POSITION                 equ 0000h
APFCON2_CCP3SEL_SIZE                     equ 0001h
APFCON2_CCP3SEL_LENGTH                   equ 0001h
APFCON2_CCP3SEL_MASK                     equ 0001h

// Register: APFCON1
#define APFCON1 APFCON1
APFCON1                                  equ 011Dh
// bitfield definitions
APFCON1_CCP2SEL_POSN                     equ 0000h
APFCON1_CCP2SEL_POSITION                 equ 0000h
APFCON1_CCP2SEL_SIZE                     equ 0001h
APFCON1_CCP2SEL_LENGTH                   equ 0001h
APFCON1_CCP2SEL_MASK                     equ 0001h
APFCON1_RXSEL_POSN                       equ 0001h
APFCON1_RXSEL_POSITION                   equ 0001h
APFCON1_RXSEL_SIZE                       equ 0001h
APFCON1_RXSEL_LENGTH                     equ 0001h
APFCON1_RXSEL_MASK                       equ 0002h
APFCON1_TXSEL_POSN                       equ 0002h
APFCON1_TXSEL_POSITION                   equ 0002h
APFCON1_TXSEL_SIZE                       equ 0001h
APFCON1_TXSEL_LENGTH                     equ 0001h
APFCON1_TXSEL_MASK                       equ 0004h
APFCON1_SDISEL_POSN                      equ 0003h
APFCON1_SDISEL_POSITION                  equ 0003h
APFCON1_SDISEL_SIZE                      equ 0001h
APFCON1_SDISEL_LENGTH                    equ 0001h
APFCON1_SDISEL_MASK                      equ 0008h
APFCON1_SCKSEL_POSN                      equ 0004h
APFCON1_SCKSEL_POSITION                  equ 0004h
APFCON1_SCKSEL_SIZE                      equ 0001h
APFCON1_SCKSEL_LENGTH                    equ 0001h
APFCON1_SCKSEL_MASK                      equ 0010h
APFCON1_SDOSEL_POSN                      equ 0005h
APFCON1_SDOSEL_POSITION                  equ 0005h
APFCON1_SDOSEL_SIZE                      equ 0001h
APFCON1_SDOSEL_LENGTH                    equ 0001h
APFCON1_SDOSEL_MASK                      equ 0020h
APFCON1_CCP1SEL_POSN                     equ 0006h
APFCON1_CCP1SEL_POSITION                 equ 0006h
APFCON1_CCP1SEL_SIZE                     equ 0001h
APFCON1_CCP1SEL_LENGTH                   equ 0001h
APFCON1_CCP1SEL_MASK                     equ 0040h
APFCON1_C2OUTSEL_POSN                    equ 0007h
APFCON1_C2OUTSEL_POSITION                equ 0007h
APFCON1_C2OUTSEL_SIZE                    equ 0001h
APFCON1_C2OUTSEL_LENGTH                  equ 0001h
APFCON1_C2OUTSEL_MASK                    equ 0080h

// Register: CM3CON0
#define CM3CON0 CM3CON0
CM3CON0                                  equ 011Eh
// bitfield definitions
CM3CON0_C3SYNC_POSN                      equ 0000h
CM3CON0_C3SYNC_POSITION                  equ 0000h
CM3CON0_C3SYNC_SIZE                      equ 0001h
CM3CON0_C3SYNC_LENGTH                    equ 0001h
CM3CON0_C3SYNC_MASK                      equ 0001h
CM3CON0_C3HYS_POSN                       equ 0001h
CM3CON0_C3HYS_POSITION                   equ 0001h
CM3CON0_C3HYS_SIZE                       equ 0001h
CM3CON0_C3HYS_LENGTH                     equ 0001h
CM3CON0_C3HYS_MASK                       equ 0002h
CM3CON0_C3SP_POSN                        equ 0002h
CM3CON0_C3SP_POSITION                    equ 0002h
CM3CON0_C3SP_SIZE                        equ 0001h
CM3CON0_C3SP_LENGTH                      equ 0001h
CM3CON0_C3SP_MASK                        equ 0004h
CM3CON0_C3ZLF_POSN                       equ 0003h
CM3CON0_C3ZLF_POSITION                   equ 0003h
CM3CON0_C3ZLF_SIZE                       equ 0001h
CM3CON0_C3ZLF_LENGTH                     equ 0001h
CM3CON0_C3ZLF_MASK                       equ 0008h
CM3CON0_C3POL_POSN                       equ 0004h
CM3CON0_C3POL_POSITION                   equ 0004h
CM3CON0_C3POL_SIZE                       equ 0001h
CM3CON0_C3POL_LENGTH                     equ 0001h
CM3CON0_C3POL_MASK                       equ 0010h
CM3CON0_C3OE_POSN                        equ 0005h
CM3CON0_C3OE_POSITION                    equ 0005h
CM3CON0_C3OE_SIZE                        equ 0001h
CM3CON0_C3OE_LENGTH                      equ 0001h
CM3CON0_C3OE_MASK                        equ 0020h
CM3CON0_C3OUT_POSN                       equ 0006h
CM3CON0_C3OUT_POSITION                   equ 0006h
CM3CON0_C3OUT_SIZE                       equ 0001h
CM3CON0_C3OUT_LENGTH                     equ 0001h
CM3CON0_C3OUT_MASK                       equ 0040h
CM3CON0_C3ON_POSN                        equ 0007h
CM3CON0_C3ON_POSITION                    equ 0007h
CM3CON0_C3ON_SIZE                        equ 0001h
CM3CON0_C3ON_LENGTH                      equ 0001h
CM3CON0_C3ON_MASK                        equ 0080h

// Register: CM3CON1
#define CM3CON1 CM3CON1
CM3CON1                                  equ 011Fh
// bitfield definitions
CM3CON1_C3NCH_POSN                       equ 0000h
CM3CON1_C3NCH_POSITION                   equ 0000h
CM3CON1_C3NCH_SIZE                       equ 0003h
CM3CON1_C3NCH_LENGTH                     equ 0003h
CM3CON1_C3NCH_MASK                       equ 0007h
CM3CON1_C3PCH_POSN                       equ 0003h
CM3CON1_C3PCH_POSITION                   equ 0003h
CM3CON1_C3PCH_SIZE                       equ 0003h
CM3CON1_C3PCH_LENGTH                     equ 0003h
CM3CON1_C3PCH_MASK                       equ 0038h
CM3CON1_C3INTN_POSN                      equ 0006h
CM3CON1_C3INTN_POSITION                  equ 0006h
CM3CON1_C3INTN_SIZE                      equ 0001h
CM3CON1_C3INTN_LENGTH                    equ 0001h
CM3CON1_C3INTN_MASK                      equ 0040h
CM3CON1_C3INTP_POSN                      equ 0007h
CM3CON1_C3INTP_POSITION                  equ 0007h
CM3CON1_C3INTP_SIZE                      equ 0001h
CM3CON1_C3INTP_LENGTH                    equ 0001h
CM3CON1_C3INTP_MASK                      equ 0080h
CM3CON1_C3NCH0_POSN                      equ 0000h
CM3CON1_C3NCH0_POSITION                  equ 0000h
CM3CON1_C3NCH0_SIZE                      equ 0001h
CM3CON1_C3NCH0_LENGTH                    equ 0001h
CM3CON1_C3NCH0_MASK                      equ 0001h
CM3CON1_C3NCH1_POSN                      equ 0001h
CM3CON1_C3NCH1_POSITION                  equ 0001h
CM3CON1_C3NCH1_SIZE                      equ 0001h
CM3CON1_C3NCH1_LENGTH                    equ 0001h
CM3CON1_C3NCH1_MASK                      equ 0002h
CM3CON1_C3NCH2_POSN                      equ 0002h
CM3CON1_C3NCH2_POSITION                  equ 0002h
CM3CON1_C3NCH2_SIZE                      equ 0001h
CM3CON1_C3NCH2_LENGTH                    equ 0001h
CM3CON1_C3NCH2_MASK                      equ 0004h
CM3CON1_C3PCH0_POSN                      equ 0003h
CM3CON1_C3PCH0_POSITION                  equ 0003h
CM3CON1_C3PCH0_SIZE                      equ 0001h
CM3CON1_C3PCH0_LENGTH                    equ 0001h
CM3CON1_C3PCH0_MASK                      equ 0008h
CM3CON1_C3PCH1_POSN                      equ 0004h
CM3CON1_C3PCH1_POSITION                  equ 0004h
CM3CON1_C3PCH1_SIZE                      equ 0001h
CM3CON1_C3PCH1_LENGTH                    equ 0001h
CM3CON1_C3PCH1_MASK                      equ 0010h
CM3CON1_C3PCH2_POSN                      equ 0005h
CM3CON1_C3PCH2_POSITION                  equ 0005h
CM3CON1_C3PCH2_SIZE                      equ 0001h
CM3CON1_C3PCH2_LENGTH                    equ 0001h
CM3CON1_C3PCH2_MASK                      equ 0020h

// Register: ANSELA
#define ANSELA ANSELA
ANSELA                                   equ 018Ch
// bitfield definitions
ANSELA_ANSA0_POSN                        equ 0000h
ANSELA_ANSA0_POSITION                    equ 0000h
ANSELA_ANSA0_SIZE                        equ 0001h
ANSELA_ANSA0_LENGTH                      equ 0001h
ANSELA_ANSA0_MASK                        equ 0001h
ANSELA_ANSA1_POSN                        equ 0001h
ANSELA_ANSA1_POSITION                    equ 0001h
ANSELA_ANSA1_SIZE                        equ 0001h
ANSELA_ANSA1_LENGTH                      equ 0001h
ANSELA_ANSA1_MASK                        equ 0002h
ANSELA_ANSA2_POSN                        equ 0002h
ANSELA_ANSA2_POSITION                    equ 0002h
ANSELA_ANSA2_SIZE                        equ 0001h
ANSELA_ANSA2_LENGTH                      equ 0001h
ANSELA_ANSA2_MASK                        equ 0004h
ANSELA_ANSA3_POSN                        equ 0003h
ANSELA_ANSA3_POSITION                    equ 0003h
ANSELA_ANSA3_SIZE                        equ 0001h
ANSELA_ANSA3_LENGTH                      equ 0001h
ANSELA_ANSA3_MASK                        equ 0008h
ANSELA_ANSA4_POSN                        equ 0004h
ANSELA_ANSA4_POSITION                    equ 0004h
ANSELA_ANSA4_SIZE                        equ 0001h
ANSELA_ANSA4_LENGTH                      equ 0001h
ANSELA_ANSA4_MASK                        equ 0010h
ANSELA_ANSA5_POSN                        equ 0005h
ANSELA_ANSA5_POSITION                    equ 0005h
ANSELA_ANSA5_SIZE                        equ 0001h
ANSELA_ANSA5_LENGTH                      equ 0001h
ANSELA_ANSA5_MASK                        equ 0020h
ANSELA_ANSA7_POSN                        equ 0007h
ANSELA_ANSA7_POSITION                    equ 0007h
ANSELA_ANSA7_SIZE                        equ 0001h
ANSELA_ANSA7_LENGTH                      equ 0001h
ANSELA_ANSA7_MASK                        equ 0080h
ANSELA_ANSELA_POSN                       equ 0000h
ANSELA_ANSELA_POSITION                   equ 0000h
ANSELA_ANSELA_SIZE                       equ 0008h
ANSELA_ANSELA_LENGTH                     equ 0008h
ANSELA_ANSELA_MASK                       equ 00FFh

// Register: ANSELB
#define ANSELB ANSELB
ANSELB                                   equ 018Dh
// bitfield definitions
ANSELB_ANSB0_POSN                        equ 0000h
ANSELB_ANSB0_POSITION                    equ 0000h
ANSELB_ANSB0_SIZE                        equ 0001h
ANSELB_ANSB0_LENGTH                      equ 0001h
ANSELB_ANSB0_MASK                        equ 0001h
ANSELB_ANSB1_POSN                        equ 0001h
ANSELB_ANSB1_POSITION                    equ 0001h
ANSELB_ANSB1_SIZE                        equ 0001h
ANSELB_ANSB1_LENGTH                      equ 0001h
ANSELB_ANSB1_MASK                        equ 0002h
ANSELB_ANSB2_POSN                        equ 0002h
ANSELB_ANSB2_POSITION                    equ 0002h
ANSELB_ANSB2_SIZE                        equ 0001h
ANSELB_ANSB2_LENGTH                      equ 0001h
ANSELB_ANSB2_MASK                        equ 0004h
ANSELB_ANSB3_POSN                        equ 0003h
ANSELB_ANSB3_POSITION                    equ 0003h
ANSELB_ANSB3_SIZE                        equ 0001h
ANSELB_ANSB3_LENGTH                      equ 0001h
ANSELB_ANSB3_MASK                        equ 0008h
ANSELB_ANSB4_POSN                        equ 0004h
ANSELB_ANSB4_POSITION                    equ 0004h
ANSELB_ANSB4_SIZE                        equ 0001h
ANSELB_ANSB4_LENGTH                      equ 0001h
ANSELB_ANSB4_MASK                        equ 0010h
ANSELB_ANSB5_POSN                        equ 0005h
ANSELB_ANSB5_POSITION                    equ 0005h
ANSELB_ANSB5_SIZE                        equ 0001h
ANSELB_ANSB5_LENGTH                      equ 0001h
ANSELB_ANSB5_MASK                        equ 0020h
ANSELB_ANSB6_POSN                        equ 0006h
ANSELB_ANSB6_POSITION                    equ 0006h
ANSELB_ANSB6_SIZE                        equ 0001h
ANSELB_ANSB6_LENGTH                      equ 0001h
ANSELB_ANSB6_MASK                        equ 0040h
ANSELB_ANSELB_POSN                       equ 0000h
ANSELB_ANSELB_POSITION                   equ 0000h
ANSELB_ANSELB_SIZE                       equ 0006h
ANSELB_ANSELB_LENGTH                     equ 0006h
ANSELB_ANSELB_MASK                       equ 003Fh

// Register: ANSELD
#define ANSELD ANSELD
ANSELD                                   equ 018Fh
// bitfield definitions
ANSELD_ANSD0_POSN                        equ 0000h
ANSELD_ANSD0_POSITION                    equ 0000h
ANSELD_ANSD0_SIZE                        equ 0001h
ANSELD_ANSD0_LENGTH                      equ 0001h
ANSELD_ANSD0_MASK                        equ 0001h
ANSELD_ANSD1_POSN                        equ 0001h
ANSELD_ANSD1_POSITION                    equ 0001h
ANSELD_ANSD1_SIZE                        equ 0001h
ANSELD_ANSD1_LENGTH                      equ 0001h
ANSELD_ANSD1_MASK                        equ 0002h
ANSELD_ANSD2_POSN                        equ 0002h
ANSELD_ANSD2_POSITION                    equ 0002h
ANSELD_ANSD2_SIZE                        equ 0001h
ANSELD_ANSD2_LENGTH                      equ 0001h
ANSELD_ANSD2_MASK                        equ 0004h
ANSELD_ANSD_POSN                         equ 0000h
ANSELD_ANSD_POSITION                     equ 0000h
ANSELD_ANSD_SIZE                         equ 0003h
ANSELD_ANSD_LENGTH                       equ 0003h
ANSELD_ANSD_MASK                         equ 0007h

