GopalSaraf/Practicals/PSDL/include/proc/pic16lf1784.inc
#define LATD5                            BANKMASK(LATD), 5
#define LATD6                            BANKMASK(LATD), 6
#define LATD7                            BANKMASK(LATD), 7
#define LATE0                            BANKMASK(LATE), 0
#define LATE1                            BANKMASK(LATE), 1
#define LATE2                            BANKMASK(LATE), 2
#define LFIOFR                           BANKMASK(OSCSTAT), 1
#define LWLO                             BANKMASK(EECON1), 5
#define MC1OUT                           BANKMASK(CMOUT), 0
#define MC2OUT                           BANKMASK(CMOUT), 1
#define MC3OUT                           BANKMASK(CMOUT), 2
#define MC4OUT                           BANKMASK(CMOUT), 3
#define MFIOFR                           BANKMASK(OSCSTAT), 2
#define MSK0                             BANKMASK(SSP1MSK), 0
#define MSK1                             BANKMASK(SSP1MSK), 1
#define MSK2                             BANKMASK(SSP1MSK), 2
#define MSK3                             BANKMASK(SSP1MSK), 3
#define MSK4                             BANKMASK(SSP1MSK), 4
#define MSK5                             BANKMASK(SSP1MSK), 5
#define MSK6                             BANKMASK(SSP1MSK), 6
#define MSK7                             BANKMASK(SSP1MSK), 7
#define ODCONA0                          BANKMASK(ODCONA), 0
#define ODCONA1                          BANKMASK(ODCONA), 1
#define ODCONA2                          BANKMASK(ODCONA), 2
#define ODCONA3                          BANKMASK(ODCONA), 3
#define ODCONA4                          BANKMASK(ODCONA), 4
#define ODCONA5                          BANKMASK(ODCONA), 5
#define ODCONA6                          BANKMASK(ODCONA), 6
#define ODCONA7                          BANKMASK(ODCONA), 7
#define ODCONB0                          BANKMASK(ODCONB), 0
#define ODCONB1                          BANKMASK(ODCONB), 1
#define ODCONB2                          BANKMASK(ODCONB), 2
#define ODCONB3                          BANKMASK(ODCONB), 3
#define ODCONB4                          BANKMASK(ODCONB), 4
#define ODCONB5                          BANKMASK(ODCONB), 5
#define ODCONB6                          BANKMASK(ODCONB), 6
#define ODCONB7                          BANKMASK(ODCONB), 7
#define ODCONC0                          BANKMASK(ODCONC), 0
#define ODCONC1                          BANKMASK(ODCONC), 1
#define ODCONC2                          BANKMASK(ODCONC), 2
#define ODCONC3                          BANKMASK(ODCONC), 3
#define ODCONC4                          BANKMASK(ODCONC), 4
#define ODCONC5                          BANKMASK(ODCONC), 5
#define ODCONC6                          BANKMASK(ODCONC), 6
#define ODCONC7                          BANKMASK(ODCONC), 7
#define ODCOND0                          BANKMASK(ODCOND), 0
#define ODCOND1                          BANKMASK(ODCOND), 1
#define ODCOND2                          BANKMASK(ODCOND), 2
#define ODCOND3                          BANKMASK(ODCOND), 3
#define ODCOND4                          BANKMASK(ODCOND), 4
#define ODCOND5                          BANKMASK(ODCOND), 5
#define ODCOND6                          BANKMASK(ODCOND), 6
#define ODCOND7                          BANKMASK(ODCOND), 7
#define ODCONE0                          BANKMASK(ODCONE), 0
#define ODCONE1                          BANKMASK(ODCONE), 1
#define ODCONE2                          BANKMASK(ODCONE), 2
#define OERR                             BANKMASK(RC1STA), 1
#define OPA1EN                           BANKMASK(OPA1CON), 7
#define OPA1PCH0                         BANKMASK(OPA1CON), 0
#define OPA1PCH1                         BANKMASK(OPA1CON), 1
#define OPA1SP                           BANKMASK(OPA1CON), 6
#define OPA2EN                           BANKMASK(OPA2CON), 7
#define OPA2PCH0                         BANKMASK(OPA2CON), 0
#define OPA2PCH1                         BANKMASK(OPA2CON), 1
#define OPA2SP                           BANKMASK(OPA2CON), 6
#define OPA3EN                           BANKMASK(OPA3CON), 7
#define OPA3PCH0                         BANKMASK(OPA3CON), 0
#define OPA3PCH1                         BANKMASK(OPA3CON), 1
#define OPA3SP                           BANKMASK(OPA3CON), 6
#define OSFIE                            BANKMASK(PIE2), 7
#define OSFIF                            BANKMASK(PIR2), 7
#define OSTS                             BANKMASK(OSCSTAT), 5
#define P1ARSEN                          BANKMASK(PSMC1ASDC), 5
#define P1ASDEN                          BANKMASK(PSMC1ASDC), 6
#define P1ASDLA                          BANKMASK(PSMC1ASDL), 0
#define P1ASDLB                          BANKMASK(PSMC1ASDL), 1
#define P1ASDLC                          BANKMASK(PSMC1ASDL), 2
#define P1ASDLD                          BANKMASK(PSMC1ASDL), 3
#define P1ASDLE                          BANKMASK(PSMC1ASDL), 4
#define P1ASDLF                          BANKMASK(PSMC1ASDL), 5
#define P1ASDOV                          BANKMASK(PSMC1ASDC), 0
#define P1ASDSC1                         BANKMASK(PSMC1ASDS), 1
#define P1ASDSC2                         BANKMASK(PSMC1ASDS), 2
#define P1ASDSC3                         BANKMASK(PSMC1ASDS), 3
#define P1ASDSC4                         BANKMASK(PSMC1ASDS), 4
#define P1ASDSIN                         BANKMASK(PSMC1ASDS), 7
#define P1ASE                            BANKMASK(PSMC1ASDC), 7
#define P1CPRE0                          BANKMASK(PSMC1CLK), 4
#define P1CPRE1                          BANKMASK(PSMC1CLK), 5
#define P1CSRC0                          BANKMASK(PSMC1CLK), 0
#define P1CSRC1                          BANKMASK(PSMC1CLK), 1
#define P1DBFE                           BANKMASK(PSMC1CON), 5
#define P1DBRE                           BANKMASK(PSMC1CON), 4
#define P1DCPOL                          BANKMASK(PSMC1SYNC), 5
#define P1DCSC1                          BANKMASK(PSMC1DCS), 1
#define P1DCSC2                          BANKMASK(PSMC1DCS), 2
#define P1DCSC3                          BANKMASK(PSMC1DCS), 3
#define P1DCSC4                          BANKMASK(PSMC1DCS), 4
#define P1DCSIN                          BANKMASK(PSMC1DCS), 7
#define P1DCST                           BANKMASK(PSMC1DCS), 0
#define P1FEBM0                          BANKMASK(PSMC1BLNK), 4
#define P1FEBM1                          BANKMASK(PSMC1BLNK), 5
#define P1FEBSC1                         BANKMASK(PSMC1FEBS), 1
#define P1FEBSC2                         BANKMASK(PSMC1FEBS), 2
#define P1FEBSC3                         BANKMASK(PSMC1FEBS), 3
#define P1FEBSC4                         BANKMASK(PSMC1FEBS), 4
#define P1FEBSIN                         BANKMASK(PSMC1FEBS), 7
#define P1HSMEN                          BANKMASK(PSMC1STR1), 0
#define P1INPOL                          BANKMASK(PSMC1POL), 6
#define P1LSMEN                          BANKMASK(PSMC1STR1), 1
#define P1MDLBIT                         BANKMASK(PSMC1MDL), 5
#define P1MDLEN                          BANKMASK(PSMC1MDL), 7
#define P1MDLPOL                         BANKMASK(PSMC1MDL), 6
#define P1MODE0                          BANKMASK(PSMC1CON), 0
#define P1MODE1                          BANKMASK(PSMC1CON), 1
#define P1MODE2                          BANKMASK(PSMC1CON), 2
#define P1MODE3                          BANKMASK(PSMC1CON), 3
#define P1MSRC0                          BANKMASK(PSMC1MDL), 0
#define P1MSRC1                          BANKMASK(PSMC1MDL), 1
#define P1MSRC2                          BANKMASK(PSMC1MDL), 2
#define P1MSRC3                          BANKMASK(PSMC1MDL), 3
#define P1OEA                            BANKMASK(PSMC1OEN), 0
#define P1OEB                            BANKMASK(PSMC1OEN), 1
#define P1OEC                            BANKMASK(PSMC1OEN), 2
#define P1OED                            BANKMASK(PSMC1OEN), 3
#define P1OEE                            BANKMASK(PSMC1OEN), 4
#define P1OEF                            BANKMASK(PSMC1OEN), 5
#define P1PHSC1                          BANKMASK(PSMC1PHS), 1
#define P1PHSC2                          BANKMASK(PSMC1PHS), 2
#define P1PHSC3                          BANKMASK(PSMC1PHS), 3
#define P1PHSC4                          BANKMASK(PSMC1PHS), 4
#define P1PHSIN                          BANKMASK(PSMC1PHS), 7
#define P1PHST                           BANKMASK(PSMC1PHS), 0
#define P1POFST                          BANKMASK(PSMC1SYNC), 7
#define P1POLA                           BANKMASK(PSMC1POL), 0
#define P1POLB                           BANKMASK(PSMC1POL), 1
#define P1POLC                           BANKMASK(PSMC1POL), 2
#define P1POLD                           BANKMASK(PSMC1POL), 3
#define P1POLE                           BANKMASK(PSMC1POL), 4
#define P1POLF                           BANKMASK(PSMC1POL), 5
#define P1PRPOL                          BANKMASK(PSMC1SYNC), 6
#define P1PRSC1                          BANKMASK(PSMC1PRS), 1
#define P1PRSC2                          BANKMASK(PSMC1PRS), 2
#define P1PRSC3                          BANKMASK(PSMC1PRS), 3
#define P1PRSC4                          BANKMASK(PSMC1PRS), 4
#define P1PRSIN                          BANKMASK(PSMC1PRS), 7
#define P1PRST                           BANKMASK(PSMC1PRS), 0
#define P1REBM0                          BANKMASK(PSMC1BLNK), 0
#define P1REBM1                          BANKMASK(PSMC1BLNK), 1
#define P1REBSC1                         BANKMASK(PSMC1REBS), 1
#define P1REBSC2                         BANKMASK(PSMC1REBS), 2
#define P1REBSC3                         BANKMASK(PSMC1REBS), 3
#define P1REBSC4                         BANKMASK(PSMC1REBS), 4
#define P1REBSIN                         BANKMASK(PSMC1REBS), 7
#define P1SSYNC                          BANKMASK(PSMC1STR1), 7
#define P1STRA                           BANKMASK(PSMC1STR0), 0
#define P1STRB                           BANKMASK(PSMC1STR0), 1
#define P1STRC                           BANKMASK(PSMC1STR0), 2
#define P1STRD                           BANKMASK(PSMC1STR0), 3
#define P1STRE                           BANKMASK(PSMC1STR0), 4
#define P1STRF                           BANKMASK(PSMC1STR0), 5
#define P1SYNC0                          BANKMASK(PSMC1SYNC), 0
#define P1SYNC1                          BANKMASK(PSMC1SYNC), 1
#define P1SYNC2                          BANKMASK(PSMC1SYNC), 2
#define P1TDCIE                          BANKMASK(PSMC1INT), 5
#define P1TDCIF                          BANKMASK(PSMC1INT), 1
#define P1TOVIE                          BANKMASK(PSMC1INT), 7
#define P1TOVIF                          BANKMASK(PSMC1INT), 3
#define P1TPHIE                          BANKMASK(PSMC1INT), 6
#define P1TPHIF                          BANKMASK(PSMC1INT), 2
#define P1TPRIE                          BANKMASK(PSMC1INT), 4
#define P1TPRIF                          BANKMASK(PSMC1INT), 0
#define P2ARSEN                          BANKMASK(PSMC2ASDC), 5
#define P2ASDEN                          BANKMASK(PSMC2ASDC), 6
#define P2ASDLA                          BANKMASK(PSMC2ASDL), 0
#define P2ASDLB                          BANKMASK(PSMC2ASDL), 1
#define P2ASDOV                          BANKMASK(PSMC2ASDC), 0
#define P2ASDSC1                         BANKMASK(PSMC2ASDS), 1
#define P2ASDSC2                         BANKMASK(PSMC2ASDS), 2
#define P2ASDSC3                         BANKMASK(PSMC2ASDS), 3
#define P2ASDSC4                         BANKMASK(PSMC2ASDS), 4
#define P2ASDSIN                         BANKMASK(PSMC2ASDS), 7
#define P2ASE                            BANKMASK(PSMC2ASDC), 7
#define P2CPRE0                          BANKMASK(PSMC2CLK), 4
#define P2CPRE1                          BANKMASK(PSMC2CLK), 5
#define P2CSRC0                          BANKMASK(PSMC2CLK), 0
#define P2CSRC1                          BANKMASK(PSMC2CLK), 1
#define P2DBFE                           BANKMASK(PSMC2CON), 5
#define P2DBRE                           BANKMASK(PSMC2CON), 4
#define P2DCPOL                          BANKMASK(PSMC2SYNC), 5
#define P2DCSC1                          BANKMASK(PSMC2DCS), 1
#define P2DCSC2                          BANKMASK(PSMC2DCS), 2
#define P2DCSC3                          BANKMASK(PSMC2DCS), 3
#define P2DCSC4                          BANKMASK(PSMC2DCS), 4
#define P2DCSIN                          BANKMASK(PSMC2DCS), 7
#define P2DCST                           BANKMASK(PSMC2DCS), 0
#define P2FEBM0                          BANKMASK(PSMC2BLNK), 4
#define P2FEBM1                          BANKMASK(PSMC2BLNK), 5
#define P2FEBSC1                         BANKMASK(PSMC2FEBS), 1
#define P2FEBSC2                         BANKMASK(PSMC2FEBS), 2
#define P2FEBSC3                         BANKMASK(PSMC2FEBS), 3
#define P2FEBSC4                         BANKMASK(PSMC2FEBS), 4
#define P2FEBSIN                         BANKMASK(PSMC2FEBS), 7
#define P2HSMEN                          BANKMASK(PSMC2STR1), 0
#define P2INPOL                          BANKMASK(PSMC2POL), 6
#define P2LSMEN                          BANKMASK(PSMC2STR1), 1
#define P2MDLBIT                         BANKMASK(PSMC2MDL), 5
#define P2MDLEN                          BANKMASK(PSMC2MDL), 7
#define P2MDLPOL                         BANKMASK(PSMC2MDL), 6
#define P2MODE0                          BANKMASK(PSMC2CON), 0
#define P2MODE1                          BANKMASK(PSMC2CON), 1
#define P2MODE2                          BANKMASK(PSMC2CON), 2
#define P2MODE3                          BANKMASK(PSMC2CON), 3
#define P2MSRC0                          BANKMASK(PSMC2MDL), 0
#define P2MSRC1                          BANKMASK(PSMC2MDL), 1
#define P2MSRC2                          BANKMASK(PSMC2MDL), 2
#define P2MSRC3                          BANKMASK(PSMC2MDL), 3
#define P2OEA                            BANKMASK(PSMC2OEN), 0
#define P2OEB                            BANKMASK(PSMC2OEN), 1
#define P2PHSC1                          BANKMASK(PSMC2PHS), 1
#define P2PHSC2                          BANKMASK(PSMC2PHS), 2
#define P2PHSC3                          BANKMASK(PSMC2PHS), 3
#define P2PHSC4                          BANKMASK(PSMC2PHS), 4
#define P2PHSIN                          BANKMASK(PSMC2PHS), 7
#define P2PHST                           BANKMASK(PSMC2PHS), 0
#define P2POFST                          BANKMASK(PSMC2SYNC), 7
#define P2POLA                           BANKMASK(PSMC2POL), 0
#define P2POLB                           BANKMASK(PSMC2POL), 1
#define P2PRPOL                          BANKMASK(PSMC2SYNC), 6
#define P2PRSC1                          BANKMASK(PSMC2PRS), 1
#define P2PRSC2                          BANKMASK(PSMC2PRS), 2
#define P2PRSC3                          BANKMASK(PSMC2PRS), 3
#define P2PRSC4                          BANKMASK(PSMC2PRS), 4
#define P2PRSIN                          BANKMASK(PSMC2PRS), 7
#define P2PRST                           BANKMASK(PSMC2PRS), 0
#define P2REBM0                          BANKMASK(PSMC2BLNK), 0
#define P2REBM1                          BANKMASK(PSMC2BLNK), 1
#define P2REBSC1                         BANKMASK(PSMC2REBS), 1
#define P2REBSC2                         BANKMASK(PSMC2REBS), 2
#define P2REBSC3                         BANKMASK(PSMC2REBS), 3
#define P2REBSC4                         BANKMASK(PSMC2REBS), 4
#define P2REBSIN                         BANKMASK(PSMC2REBS), 7
#define P2SSYNC                          BANKMASK(PSMC2STR1), 7
#define P2STRA                           BANKMASK(PSMC2STR0), 0
#define P2STRB                           BANKMASK(PSMC2STR0), 1
#define P2SYNC0                          BANKMASK(PSMC2SYNC), 0
#define P2SYNC1                          BANKMASK(PSMC2SYNC), 1
#define P2SYNC2                          BANKMASK(PSMC2SYNC), 2
#define P2TDCIE                          BANKMASK(PSMC2INT), 5
#define P2TDCIF                          BANKMASK(PSMC2INT), 1
#define P2TOVIE                          BANKMASK(PSMC2INT), 7
#define P2TOVIF                          BANKMASK(PSMC2INT), 3
#define P2TPHIE                          BANKMASK(PSMC2INT), 6
#define P2TPHIF                          BANKMASK(PSMC2INT), 2
#define P2TPRIE                          BANKMASK(PSMC2INT), 4
#define P2TPRIF                          BANKMASK(PSMC2INT), 0
#define P3ARSEN                          BANKMASK(PSMC3ASDC), 5
#define P3ASDEN                          BANKMASK(PSMC3ASDC), 6
#define P3ASDLA                          BANKMASK(PSMC3ASDL), 0
#define P3ASDLB                          BANKMASK(PSMC3ASDL), 1
#define P3ASDLC                          BANKMASK(PSMC3ASDL), 2
#define P3ASDLD                          BANKMASK(PSMC3ASDL), 3
#define P3ASDLE                          BANKMASK(PSMC3ASDL), 4
#define P3ASDLF                          BANKMASK(PSMC3ASDL), 5
#define P3ASDOV                          BANKMASK(PSMC3ASDC), 0
#define P3ASDSC1                         BANKMASK(PSMC3ASDS), 1
#define P3ASDSC2                         BANKMASK(PSMC3ASDS), 2
#define P3ASDSC3                         BANKMASK(PSMC3ASDS), 3
#define P3ASDSC4                         BANKMASK(PSMC3ASDS), 4
#define P3ASDSIN                         BANKMASK(PSMC3ASDS), 7
#define P3ASE                            BANKMASK(PSMC3ASDC), 7
#define P3CPRE0                          BANKMASK(PSMC3CLK), 4
#define P3CPRE1                          BANKMASK(PSMC3CLK), 5
#define P3CSRC0                          BANKMASK(PSMC3CLK), 0
#define P3CSRC1                          BANKMASK(PSMC3CLK), 1
#define P3DBFE                           BANKMASK(PSMC3CON), 5
#define P3DBRE                           BANKMASK(PSMC3CON), 4
#define P3DCPOL                          BANKMASK(PSMC3SYNC), 5
#define P3DCSC1                          BANKMASK(PSMC3DCS), 1
#define P3DCSC2                          BANKMASK(PSMC3DCS), 2
#define P3DCSC3                          BANKMASK(PSMC3DCS), 3
#define P3DCSC4                          BANKMASK(PSMC3DCS), 4
#define P3DCSIN                          BANKMASK(PSMC3DCS), 7
#define P3DCST                           BANKMASK(PSMC3DCS), 0
#define P3FEBM0                          BANKMASK(PSMC3BLNK), 4
#define P3FEBM1                          BANKMASK(PSMC3BLNK), 5
#define P3FEBSC1                         BANKMASK(PSMC3FEBS), 1
#define P3FEBSC2                         BANKMASK(PSMC3FEBS), 2
#define P3FEBSC3                         BANKMASK(PSMC3FEBS), 3
#define P3FEBSC4                         BANKMASK(PSMC3FEBS), 4
#define P3FEBSIN                         BANKMASK(PSMC3FEBS), 7
#define P3HSMEN                          BANKMASK(PSMC3STR1), 0
#define P3INPOL                          BANKMASK(PSMC3POL), 6
#define P3LSMEN                          BANKMASK(PSMC3STR1), 1
#define P3MDLBIT                         BANKMASK(PSMC3MDL), 5
#define P3MDLEN                          BANKMASK(PSMC3MDL), 7
#define P3MDLPOL                         BANKMASK(PSMC3MDL), 6
#define P3MODE0                          BANKMASK(PSMC3CON), 0
#define P3MODE1                          BANKMASK(PSMC3CON), 1
#define P3MODE2                          BANKMASK(PSMC3CON), 2
#define P3MODE3                          BANKMASK(PSMC3CON), 3
#define P3MSRC0                          BANKMASK(PSMC3MDL), 0
#define P3MSRC1                          BANKMASK(PSMC3MDL), 1
#define P3MSRC2                          BANKMASK(PSMC3MDL), 2
#define P3MSRC3                          BANKMASK(PSMC3MDL), 3
#define P3OEA                            BANKMASK(PSMC3OEN), 0
#define P3OEB                            BANKMASK(PSMC3OEN), 1
#define P3OEC                            BANKMASK(PSMC3OEN), 2
#define P3OED                            BANKMASK(PSMC3OEN), 3
#define P3OEE                            BANKMASK(PSMC3OEN), 4
#define P3OEF                            BANKMASK(PSMC3OEN), 5
#define P3PHSC1                          BANKMASK(PSMC3PHS), 1
#define P3PHSC2                          BANKMASK(PSMC3PHS), 2
#define P3PHSC3                          BANKMASK(PSMC3PHS), 3
#define P3PHSC4                          BANKMASK(PSMC3PHS), 4
#define P3PHSIN                          BANKMASK(PSMC3PHS), 7
#define P3PHST                           BANKMASK(PSMC3PHS), 0
#define P3POFST                          BANKMASK(PSMC3SYNC), 7
#define P3POLA                           BANKMASK(PSMC3POL), 0
#define P3POLB                           BANKMASK(PSMC3POL), 1
#define P3POLC                           BANKMASK(PSMC3POL), 2
#define P3POLD                           BANKMASK(PSMC3POL), 3
#define P3POLE                           BANKMASK(PSMC3POL), 4
#define P3POLF                           BANKMASK(PSMC3POL), 5
#define P3PRPOL                          BANKMASK(PSMC3SYNC), 6
#define P3PRSC1                          BANKMASK(PSMC3PRS), 1
#define P3PRSC2                          BANKMASK(PSMC3PRS), 2
#define P3PRSC3                          BANKMASK(PSMC3PRS), 3
#define P3PRSC4                          BANKMASK(PSMC3PRS), 4
#define P3PRSIN                          BANKMASK(PSMC3PRS), 7
#define P3PRST                           BANKMASK(PSMC3PRS), 0
#define P3REBM0                          BANKMASK(PSMC3BLNK), 0
#define P3REBM1                          BANKMASK(PSMC3BLNK), 1
#define P3REBSC1                         BANKMASK(PSMC3REBS), 1
#define P3REBSC2                         BANKMASK(PSMC3REBS), 2
#define P3REBSC3                         BANKMASK(PSMC3REBS), 3
#define P3REBSC4                         BANKMASK(PSMC3REBS), 4
#define P3REBSIN                         BANKMASK(PSMC3REBS), 7
#define P3SSYNC                          BANKMASK(PSMC3STR1), 7
#define P3STRA                           BANKMASK(PSMC3STR0), 0
#define P3STRB                           BANKMASK(PSMC3STR0), 1
#define P3STRC                           BANKMASK(PSMC3STR0), 2
#define P3STRD                           BANKMASK(PSMC3STR0), 3
#define P3STRE                           BANKMASK(PSMC3STR0), 4
#define P3STRF                           BANKMASK(PSMC3STR0), 5
#define P3SYNC0                          BANKMASK(PSMC3SYNC), 0
#define P3SYNC1                          BANKMASK(PSMC3SYNC), 1
#define P3SYNC2                          BANKMASK(PSMC3SYNC), 2
#define P3TDCIE                          BANKMASK(PSMC3INT), 5
#define P3TDCIF                          BANKMASK(PSMC3INT), 1
#define P3TOVIE                          BANKMASK(PSMC3INT), 7
#define P3TOVIF                          BANKMASK(PSMC3INT), 3
#define P3TPHIE                          BANKMASK(PSMC3INT), 6
#define P3TPHIF                          BANKMASK(PSMC3INT), 2
#define P3TPRIE                          BANKMASK(PSMC3INT), 4
#define P3TPRIF                          BANKMASK(PSMC3INT), 0
#define PCIE                             BANKMASK(SSP1CON3), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PEN                              BANKMASK(SSP1CON2), 2
#define PLLR                             BANKMASK(OSCSTAT), 6
#define PMSC3TIE                         BANKMASK(PIE4), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define PSMC1BLKF0                       BANKMASK(PSMC1BLKF), 0
#define PSMC1BLKF1                       BANKMASK(PSMC1BLKF), 1
#define PSMC1BLKF2                       BANKMASK(PSMC1BLKF), 2
#define PSMC1BLKF3                       BANKMASK(PSMC1BLKF), 3
#define PSMC1BLKF4                       BANKMASK(PSMC1BLKF), 4
#define PSMC1BLKF5                       BANKMASK(PSMC1BLKF), 5
#define PSMC1BLKF6                       BANKMASK(PSMC1BLKF), 6
#define PSMC1BLKF7                       BANKMASK(PSMC1BLKF), 7
#define PSMC1BLKR0                       BANKMASK(PSMC1BLKR), 0
#define PSMC1BLKR1                       BANKMASK(PSMC1BLKR), 1
#define PSMC1BLKR2                       BANKMASK(PSMC1BLKR), 2
#define PSMC1BLKR3                       BANKMASK(PSMC1BLKR), 3
#define PSMC1BLKR4                       BANKMASK(PSMC1BLKR), 4
#define PSMC1BLKR5                       BANKMASK(PSMC1BLKR), 5
#define PSMC1BLKR6                       BANKMASK(PSMC1BLKR), 6
